In [3]:
import pandas as pd
calisan_verileri = pd.read_csv("employees.csv")
calisan_verileri.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [4]:
calisan_verileri_tablo = pd.read_table("employees.csv", sep=',', decimal='.')
calisan_verileri_tablo.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [66]:
calisan_verileri.shape

(1000, 8)

In [ ]:
calisan_verileri.to_csv("calisan_veriler.csv")

In [6]:
seri_ornegi = pd.Series([1,2,3,5,8]) # Seriler tek boyutlu diziler gibidir.
seri_ornegi

0    1
1    2
2    3
3    5
4    8
dtype: int64

In [9]:
print(seri_ornegi.values) # serideki elemanlara ulaşmak için
print(seri_ornegi.index) # serideki indeks değerleri

[1 2 3 5 8]
RangeIndex(start=0, stop=5, step=1)

In [11]:
seri_ornegi = pd.Series([1,2,3,5,8], index=['a','b','c','d','e'])
seri_ornegi['c'] # serinin elemanlarına indeks değeri ile ulaşılır

3

In [16]:
print(seri_ornegi[1:3])

b    2
c    3
dtype: int64
b    2
c    3
dtype: int64

In [20]:
# dataframe
import numpy as np
veri_cercevesi = pd.DataFrame(np.random.rand(3, 2),
                   columns=['sutun 1', 'sutun 2'],
                   index=['a', 'b', 'c'])

In [21]:
veri_cercevesi

    sutun 1   sutun 2
a  0.377589  0.364145
b  0.487318  0.126421
c  0.076078  0.042498

In [22]:
# başka veri çerçevesi oluşturma yöntemi
plaka_kodlari = {'Istanbul': '34', 'Sakarya': '54', 'KahramanMaraş': '46'}
nufus_sayilari = {
    'Istanbul': 20000000,
    'Sakarya': 1100000,
    'KahramanMaraş': 1000000
}
sehirler = pd.DataFrame({'plakalar':plaka_kodlari,'nufus':nufus_sayilari})

In [23]:
sehirler

              plakalar     nufus
Istanbul            34  20000000
Sakarya             54   1100000
KahramanMaraş       46   1000000

In [25]:
sehirler.iloc[1,0] # ikinci şehrin(Sakarya)'nın birinci özellğini(plakasını) getirir

'54'

In [67]:
sehirler.iloc[:,0] # tüm satırlar birinci sütun

Istanbul         34
Sakarya          54
KahramanMaraş    46
Name: plakalar, dtype: object

In [68]:
sehirler.iloc[:2, :2] # ilk 2 satır, ilk 2 sütun

         plakalar     nufus
Istanbul       34  20000000
Sakarya        54   1100000

In [69]:
sehirler.iloc[[0, 1], 1] # Belirli satır ve sütunları getirebiliriz

Istanbul    20000000
Sakarya      1100000
Name: nufus, dtype: int64

In [27]:
print(sehirler.loc['Istanbul']) # istanbul'a ait bilgileri getirir.

plakalar          34
nufus       20000000
Name: Istanbul, dtype: object

In [28]:
print(sehirler.loc['Istanbul','nufus']) # istanbul'un nüfusunu getirir.

20000000

In [29]:
print(sehirler.loc[['Istanbul','Sakarya'],'nufus']) # istanbul ve sakarya'nın nüfusunu getirir.

Istanbul    20000000
Sakarya      1100000
Name: nufus, dtype: int64

In [31]:
print(sehirler.loc[['Istanbul','Sakarya'],['nufus','plakalar']]) # nüfus ve plakaları getirir.

             nufus plakalar
Istanbul  20000000       34
Sakarya    1100000       54

In [35]:
sehirler.loc[sehirler.nufus>1000000]

         plakalar     nufus
Istanbul       34  20000000
Sakarya        54   1100000

In [71]:
sehirler.loc[sehirler.plakalar=='34'] # plakası 34 olan şehri getir

         plakalar     nufus
Istanbul       34  20000000

In [38]:
sehirler['nufus']

Istanbul         20000000
Sakarya           1100000
KahramanMaraş     1000000
Name: nufus, dtype: int64

In [73]:
sehirler.iloc[0,1] = 25000000
sehirler.loc['Istanbul', 'nufus'] = 25000000

In [74]:
sehirler['bolge'] = ['Marmara', 'Marmara', 'Akdeniz'] # bolge isminde bir sütun oluşturur ve içerisine verileri girer.

In [75]:
sehirler

              plakalar     nufus    bolge
Istanbul            34  25000000  Marmara
Sakarya             54   1100000  Marmara
KahramanMaraş       46   1000000  Akdeniz

In [43]:
indeks_1 = pd.Index([1, 2, 3, 4, 5])
indeks_2 = pd.Index([2, 4, 6])

In [44]:
indeks_1[2] = 3 # indeks elemanları değiştirilemezdir.

TypeError: Index does not support mutable operations

In [50]:
print(indeks_1.intersection(indeks_2)) # kesişim kümesi
print(indeks_1.union(indeks_2)) # birleşim kümesi
print(indeks_1.difference(indeks_2)) # fark kümesi

Int64Index([2, 4], dtype='int64')
Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')
Int64Index([1, 3, 5], dtype='int64')

In [64]:
calisan_verileri.Team.value_counts() # Hangi takımda kaç kişi var?

Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

In [65]:
calisan_verileri.Team.value_counts(normalize=True) # normalize edildiğinde

Client Services         0.110763
Finance                 0.106583
Business Development    0.105538
Marketing               0.102403
Product                 0.099269
Sales                   0.098224
Engineering             0.096134
Human Resources         0.095089
Distribution            0.094044
Legal                   0.091954
Name: Team, dtype: float64

In [51]:
calisan_verileri.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [54]:
calisan_verileri.mean(0) # sütunlara göre ortalama

Salary               90662.181000
Bonus %                 10.207555
Senior Management        0.501608
dtype: float64

In [55]:
calisan_verileri.mean(1) # satırlara göre ortalamalar

0      48657.4725
1      30968.5850
2      65300.9290
3      69357.1700
4      50502.6945
          ...
995    66249.8275
996    21205.8375
997    48457.7105
998    30255.9925
999    64979.5845
Length: 1000, dtype: float64

In [57]:
# Salary özelliğinin en küçük, en büyük ve ortalamalarının gösterilmesi istenirse aşağıdaki gibi tek tek de çalıştırılabilir.

print (calisan_verileri.Salary.min(), calisan_verileri.Salary.max(), calisan_verileri.Salary.mean())

35013 149908 90662.181

In [76]:
calisan_verileri.Team.unique() # Var olan takımları liste olarak getirir.

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [62]:
calisan_verileri.groupby('Team').sum() # takımlara ait istatistikler

                       Salary   Bonus %
Team
Business Development  9278498  1067.810
Client Services       9351789  1112.481
Distribution          7965042   865.408
Engineering           8672766   962.595
Finance               9406387  1039.061
Human Resources       8275952   909.443
Legal                 7858718   908.409
Marketing             8862688  1014.638
Product               8423223   930.191
Sales                 8664303   950.990

In [85]:
calisan_verileri.groupby('Team').Team.count() # hangi takımda kaç kişi var?

Team
Business Development    101
Client Services         106
Distribution             90
Engineering              92
Finance                 102
Human Resources          91
Legal                    88
Marketing                98
Product                  95
Sales                    94
Name: Team, dtype: int64

In [63]:
calisan_verileri.Salary.apply(lambda x:x+1000) # Maaşlara 1000'lik bir artış gerçekleştirildi.

0       98308
1       62933
2      131590
3      139705
4      102004
        ...
995    133483
996     43392
997     97914
998     61500
999    130949
Name: Salary, Length: 1000, dtype: int64

In [77]:
calisan_verileri['ortalamadan_sapma']= calisan_verileri.Salary.map(lambda x: x - calisan_verileri.Salary.mean() )

In [79]:
calisan_verileri.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,ortalamadan_sapma
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,6645.819
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN,-28729.181
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,39927.819
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,48042.819
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,10341.819

In [80]:
def olcekle(x):
    x['Salary'] /= x['Salary'].sum()
    return x

In [82]:
calisan_verileri.groupby(by='Team').apply(olcekle).head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,ortalamadan_sapma
0,Douglas,Male,8/6/1993,12:42 PM,0.010980,6.945,True,Marketing,6645.819
2,Maria,Female,4/23/1993,11:17 AM,0.013883,11.858,False,Finance,39927.819
3,Jerry,Male,3/4/2005,1:00 PM,0.014746,9.340,True,Finance,48042.819
4,Larry,Male,1/24/1998,4:47 PM,0.010801,1.389,True,Client Services,10341.819
5,Dennis,Male,4/18/1987,1:35 AM,0.014654,10.125,False,Legal,24500.819

In [87]:
calisan_verileri.sort_values(by='Salary').head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,ortalamadan_sapma
576,Michael,Male,7/30/1993,5:35 PM,35013,14.879,False,Product,-55649.181
238,Kevin,Male,3/25/1982,7:31 AM,35061,5.128,False,Legal,-55601.181
82,Steven,Male,3/30/1980,9:20 PM,35095,8.379,True,Client Services,-55567.181
63,Matthew,Male,1/2/2013,10:33 PM,35203,18.040,False,Human Resources,-55459.181
650,Cynthia,Female,7/5/1986,1:24 AM,35381,11.749,False,Finance,-55281.181

In [88]:
calisan_verileri.sort_values(by='Salary', ascending=False).head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,ortalamadan_sapma
644,Katherine,Female,8/13/1996,12:21 AM,149908,18.912,False,Finance,59245.819
429,Rose,Female,5/28/2015,8:40 AM,149903,5.630,False,Human Resources,59240.819
828,Cynthia,Female,7/12/2006,8:55 AM,149684,7.864,False,Product,59021.819
186,NaN,Female,2/23/2005,9:50 PM,149654,1.825,NaN,Sales,58991.819
160,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance,58900.819

In [90]:
calisan_verileri.sort_values(by=['Salary', 'Bonus %'], ascending=False).head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,ortalamadan_sapma
644,Katherine,Female,8/13/1996,12:21 AM,149908,18.912,False,Finance,59245.819
429,Rose,Female,5/28/2015,8:40 AM,149903,5.630,False,Human Resources,59240.819
828,Cynthia,Female,7/12/2006,8:55 AM,149684,7.864,False,Product,59021.819
186,NaN,Female,2/23/2005,9:50 PM,149654,1.825,NaN,Sales,58991.819
160,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance,58900.819

In [93]:
calisan_verileri.rename(columns= {'Bonus %': 'Bonus'}).head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus,Senior Management,Team,ortalamadan_sapma
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,6645.819
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN,-28729.181
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,39927.819
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,48042.819
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,10341.819

In [94]:
yeni_sutun = np.random.randint(1000)
calisan_verileri.insert(2,'yeni_sutun', yeni_sutun)

In [95]:
calisan_verileri.head()

,First Name,Gender,yeni_sutun,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,ortalamadan_sapma
0,Douglas,Male,747,8/6/1993,12:42 PM,97308,6.945,True,Marketing,6645.819
1,Thomas,Male,747,3/31/1996,6:53 AM,61933,4.170,True,NaN,-28729.181
2,Maria,Female,747,4/23/1993,11:17 AM,130590,11.858,False,Finance,39927.819
3,Jerry,Male,747,3/4/2005,1:00 PM,138705,9.340,True,Finance,48042.819
4,Larry,Male,747,1/24/1998,4:47 PM,101004,1.389,True,Client Services,10341.819

In [97]:
calisan_verileri.sample(2)

,First Name,Gender,yeni_sutun,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,ortalamadan_sapma
77,Charles,Male,747,9/14/2004,8:13 PM,107391,1.260,True,Marketing,16728.819
389,Sharon,NaN,747,10/28/1984,5:59 PM,97635,10.413,True,Client Services,6972.819

In [98]:
calisan_verileri.nunique()

First Name           200
Gender                 2
yeni_sutun             1
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
ortalamadan_sapma    995
dtype: int64

In [102]:
calisan_verileri.select_dtypes(include='float').head()

   Bonus %  ortalamadan_sapma
0    6.945           6645.819
1    4.170         -28729.181
2   11.858          39927.819
3    9.340          48042.819
4    1.389          10341.819